ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/flc_regs.h
/**
 * @file
 * @brief   registers, bit masks and bit positions for the Flash
 *          Controller (FLC) peripheral module.
 */

/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, Maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-10-10 18:54:04 -0500 (Mon, 10 Oct 2016) $
 * $Revision: 24658 $
 *
 *************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_FLC_REGS_H_
#define _MXC_FLC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __RO
#define __RO volatile const
#endif
/// @endcond
/**
 * @ingroup     flc
 * @defgroup    flc_registers   Registers
 * @brief       Registers, Bit Masks, Bit Positions and Values for the FLC Peripheral Module.
 */
/* **** Definitions **** */
/**
 * @ingroup     flc_registers
 * @defgroup    flc_special_codes   Flash Controller Codes/Keys.
 * @brief       Required values to pass to the flash controller to perform restricted
 *              operations.
 * @{
 */
#define MXC_V_FLC_ERASE_CODE_PAGE_ERASE   ((uint8_t)0x55)           /**< Page Erase Code required to perform a page erase operation */
#define MXC_V_FLC_ERASE_CODE_MASS_ERASE   ((uint8_t)0xAA)           /**< Mass Erase Code required to perform a page erase operation */
#define MXC_V_FLC_FLSH_UNLOCK_KEY         ((uint8_t)0x2)            /**< Unlock Code required to unlock the flash for erase and write functions */
/**@} end of flc_special_codes */


/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/

/**
 * @ingroup    flc_registers
 * @brief      Structure type to access the Flash Controller registers with
 *             direct 32-bit access to each.
 */
typedef struct {
    __IO uint32_t faddr;                   /**<  <tt>\b 0x0000:       </tt> FLC_FADDR Register - Flash Operation Address                                          */
    __IO uint32_t fckdiv;                  /**<  <tt>\b 0x0004:       </tt> FLC_FCKDIV Register - Flash Clock Pulse Divisor                                       */
    __IO uint32_t ctrl;                    /**<  <tt>\b 0x0008:       </tt> FLC_CTRL Register - Flash Control Register                                            */
    __RO uint32_t rsv00C[6];               /**<  <tt>\b 0x000C-0x0020:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t intr;                    /**<  <tt>\b 0x0024:       </tt> FLC_INTR Register - Flash Controller Interrupt Flags and Enable/Disable 0             */
    __RO uint32_t rsv028[2];               /**<  <tt>\b 0x0028-0x002C:</tt> RESERVED                                                                              */
    __IO uint32_t fdata;                   /**<  <tt>\b 0x0030:       </tt> FLC_FDATA Register - Flash Operation Data Register                                    */
    __RO uint32_t rsv034[7];               /**<  <tt>\b 0x0034-0x004C:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t perform;                 /**<  <tt>\b 0x0050:       </tt> FLC_PERFORM Register - Flash Performance Settings                                     */
    __IO uint32_t tacc;                    /**<  <tt>\b 0x0054:       </tt> FLC_TACC Register - Flash Read Cycle Config                                           */
    __IO uint32_t tprog;                   /**<  <tt>\b 0x0058:       </tt> FLC_TPROG Register - Flash Write Cycle Config                                         */
    __RO uint32_t rsv05C[9];               /**<  <tt>\b 0x005C-0x007C:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t status;                  /**<  <tt>\b 0x0080:       </tt> FLC_STATUS Register - Security Status Flags                                           */
    __RO uint32_t rsv084;                  /**<  <tt>\b 0x0084:       </tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t security;                /**<  <tt>\b 0x0088:       </tt> FLC_SECURITY Register - Flash Controller Security Settings                            */
    __RO uint32_t rsv08C[4];               /**<  <tt>\b 0x008C-0x0098:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t bypass;                  /**<  <tt>\b 0x009C:       </tt> FLC_BYPASS Register - Status Flags for DSB Operations                                 */
    __RO uint32_t rsv0A0[24];              /**<  <tt>\b 0x00A0-0x00FC:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t user_option;             /**<  <tt>\b 0x0100:       </tt> FLC_USER_OPTION Register - Used to set DSB Access code and Auto-Lock in info block    */
    __RO uint32_t rsv104[15];              /**<  <tt>\b 0x0104-0x013C:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t ctrl2;                   /**<  <tt>\b 0x0140:       </tt> FLC_CTRL2 Register - Flash Control Register 2                                         */
    __IO uint32_t intfl1;                  /**<  <tt>\b 0x0144:       </tt> FLC_INTFL1 Register - Interrupt Flags Register 1                                      */
    __IO uint32_t inten1;                  /**<  <tt>\b 0x0148:       </tt> FLC_INTEN1 Register - Interrupt Enable/Disable Register 1                             */
    __RO uint32_t rsv14C[9];               /**<  <tt>\b 0x014C-0x016C:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t bl_ctrl;                 /**<  <tt>\b 0x0170:       </tt> FLC_BL_CTRL Register - Bootloader Control Register                                    */
    __IO uint32_t twk;                     /**<  <tt>\b 0x0174:       </tt> FLC_TWK Register - PDM33 Register                                                     */
    __RO uint32_t rsv178;                  /**<  <tt>\b 0x0178:       </tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t slm;                     /**<  <tt>\b 0x017C:       </tt> FLC_SLM Register - Sleep Mode Register                                                */
    __RO uint32_t rsv180[32];              /**<  <tt>\b 0x0180-0x01FC:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t disable_xr0;             /**<  <tt>\b 0x0200:       </tt> FLC_DISABLE_XR0 Register - Disable Flash Page Exec/Read Register 0                    */
    __IO uint32_t disable_xr1;             /**<  <tt>\b 0x0204:       </tt> FLC_DISABLE_XR1 Register - Disable Flash Page Exec/Read Register 1                    */
    __IO uint32_t disable_xr2;             /**<  <tt>\b 0x0208:       </tt> FLC_DISABLE_XR2 Register - Disable Flash Page Exec/Read Register 2                    */
    __IO uint32_t disable_xr3;             /**<  <tt>\b 0x020C:       </tt> FLC_DISABLE_XR3 Register - Disable Flash Page Exec/Read Register 3                    */
    __IO uint32_t disable_xr4;             /**<  <tt>\b 0x0210:       </tt> FLC_DISABLE_XR4 Register - Disable Flash Page Exec/Read Register 4                    */
    __IO uint32_t disable_xr5;             /**<  <tt>\b 0x0214:       </tt> FLC_DISABLE_XR5 Register - Disable Flash Page Exec/Read Register 5                    */
    __IO uint32_t disable_xr6;             /**<  <tt>\b 0x0218:       </tt> FLC_DISABLE_XR6 Register - Disable Flash Page Exec/Read Register 6                    */
    __IO uint32_t disable_xr7;             /**<  <tt>\b 0x021C:       </tt> FLC_DISABLE_XR7 Register - Disable Flash Page Exec/Read Register 7                    */
    __RO uint32_t rsv220[56];              /**<  <tt>\b 0x0220-0x02FC:</tt> RESERVED \warning Do Not Modify Reserved Locations!                                   */
    __IO uint32_t disable_we0;             /**<  <tt>\b 0x0300:       </tt> FLC_DISABLE_WE0 Register - Disable Flash Page Write/Erase Register 0                  */
    __IO uint32_t disable_we1;             /**<  <tt>\b 0x0304:       </tt> FLC_DISABLE_WE1 Register - Disable Flash Page Write/Erase Register 1                  */
    __IO uint32_t disable_we2;             /**<  <tt>\b 0x0308:       </tt> FLC_DISABLE_WE2 Register - Disable Flash Page Write/Erase Register 2                  */
    __IO uint32_t disable_we3;             /**<  <tt>\b 0x030C:       </tt> FLC_DISABLE_WE3 Register - Disable Flash Page Write/Erase Register 3                  */
    __IO uint32_t disable_we4;             /**<  <tt>\b 0x0310:       </tt> FLC_DISABLE_WE4 Register - Disable Flash Page Write/Erase Register 4                  */
    __IO uint32_t disable_we5;             /**<  <tt>\b 0x0314:       </tt> FLC_DISABLE_WE5 Register - Disable Flash Page Write/Erase Register 5                  */
    __IO uint32_t disable_we6;             /**<  <tt>\b 0x0318:       </tt> FLC_DISABLE_WE6 Register - Disable Flash Page Write/Erase Register 6                  */
    __IO uint32_t disable_we7;             /**<  <tt>\b 0x031C:       </tt> FLC_DISABLE_WE7 Register - Disable Flash Page Write/Erase Register 7                  */
} mxc_flc_regs_t;
